app/views/articles/new.html.haml

    = f.label :author_id, t('author')
    = collection_select(:article, :author_id, Author.all, :id, :name, {prompt: t('select_author')}, {class: "form-control", required: true})
---
SELECT `authors`.* FROM `authors`