app/controllers/articles_controller.rb

  def create
    author_id = params[:article][:author_id]
    if !author_id.empty?
      author = Author.find(author_id)
      article = author.articles.create(params.require(:article).permit(:name, :text))
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = ? LIMIT 1  [["id", nil]]
INSERT INTO `articles` (`name`, `text`, `author_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["name", "kkkk"], ["text", "sadasdasdkkk"], ["author_id", 4], ["created_at", "2015-04-24 04:50:47"], ["updated_at", "2015-04-24 04:50:47"]]

  def update
    article = Article.find(params[:id])
    article.update_attributes(params.require(:article).permit(:name, :text))
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `articles` SET `name` = ?, `text` = ?, `updated_at` = ? WHERE `articles`.`id` = ?  [["name", "Hihi1"], ["text", "HihiHihiHihiHihiHihi1"], ["updated_at", "2015-04-24 07:28:13"], ["id", 3]]

  def comment
    article_id = params[:id]
    if !article_id.empty?
      article = Article.find(article_id)
      comment = article.comments.create(text: params[:text])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = ? LIMIT 1  [["id", 3]]
INSERT INTO `comments` (`text`, `article_id`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["text", "asdsad"], ["article_id", 3], ["created_at", "2015-04-24 06:57:29"], ["updated_at", "2015-04-24 06:57:29"]]